TSD_TK/src/DataProcessors/Комплектовщик/Комплектовщик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Комплектовщик</name>
  <tabularSections>
    <name>Документы</name>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/DataProcessors/Комплектовщик/Forms/Аудит/Module.bsl
#Область ОписаниеПеременных
&НаКлиенте
Перем ВыполняетсяЗакрытие;

#КонецОбласти

	
	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	ТипАудита = Параметры.ТипАудита;
	Если Параметры.ТипДокумента = "Аудит1" Тогда
		Заголовок ="Аудит ТО"; 
	Иначе 
		Заголовок ="Аудит PKG"; 
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаPKG,ГруппаТУ,ГруппаЗапросОчистки", "Видимость",Ложь);
	

	ИнициализироватьКонстантыФормы();
	ОбновитьПодразделение();
	ОбновитьСотрудника();	
	НастроитьФормуПоЗначениямНастроек();
  	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь; 
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщение", "Видимость",Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
	
	КонецЕсли;

КонецПроцедуры




////
&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
		
	Иначе

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;
	
	ОпределитьДоступностьКнопкиСканирования();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован
	);
	
КонецПроцедуры   

 &НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
		
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОпределитьДоступностьКнопкиСканирования();
	
	НастроитьЭлементыАсинхронногоСканера();
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

	ОпределитьДоступностьКнопкиСканирования();  
	Если ТипАудита = 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаТУ,ОчиститьТЕ", "Видимость", ПользовательИнициализирован);
	ИначеЕсли ТипАудита = 2 Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаPKG", "Видимость", ПользовательИнициализирован);
	КонецЕсли;
	Если ТипАудита = 1 И ПользовательИнициализирован Тогда
		ПолучитьДанныеПоЗапросамОчистки();
	КонецЕсли;
	
//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность", Инициализирован И ПользовательИнициализирован);
	
КонецПроцедуры

 &НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры


    
&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат;   
	КонецЕсли;  
	Если ТипАудита = 1 Тогда
		Если СтрНачинаетсяС(ПолученныйШтрихкод,"TE;") Тогда 
			ТЕИнфо = ПолучитьДанныеТЕ_НаСервере(ПолученныйШтрихкод);
			Если ТЕИнфо.Результат Тогда
			Иначе
				Если НЕ ПустаяСтрока(ТЕИнфо.ОписаниеОшибки) Тогда
					Сообщить(ТЕИнфо.ОписаниеОшибки);
				КонецЕсли;
			КонецЕсли;
		Иначе 
			Сообщить("Відскануйте ТО");
			Возврат;
		КонецЕсли;
	
		
	ИначеЕсли ТипАудита = 2 Тогда
		Если СтрЧислоВхождений(ПолученныйШтрихкод,";")=2 Тогда
			Рез = ПолучитьДанныеPKG_НаСервере(ПолученныйШтрихкод)
		Иначе   
			 НайтиТоварPKG_НаКлиенте(ПолученныйШтрихкод);	
			//Если НЕ Рез Тогда
			//Сообщить("Відскануйте PKG"); 
			//КонецЕсли;
			//Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры 




&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры 


&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТУВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТУПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТУПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

 &НаКлиенте
Процедура ДекорацияОчисткаНажатие(Элемент)
	ДанныеПоЗапросамОчистки();
КонецПроцедуры



&НаКлиенте
Процедура ОчиститьТЕ(Команда)
	Если ТаблицаТУ.Количество() = 0 Тогда  
		ОчиститьСообщения();
		Сообщить("ТО порожня");
		Возврат;
	КонецЕсли;
	 ОчиститьТЕ_Асинх();
КонецПроцедуры



 &НаКлиенте
Асинх Процедура ОчиститьТЕ_Асинх()
	
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Очистити розміщені PKG", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	
	РезультатОчистки = ОчиститьРазмещенныеPKG();
	Если НЕ РезультатОчистки.Результат Тогда  
		Если НЕ ПустаяСтрока(РезультатОчистки.ОписаниеОшибки) Тогда
			Сообщить(РезультатОчистки.ОписаниеОшибки); 
		КонецЕсли; 
	Иначе
		ТаблицаТУ.Очистить(); 
		ПолучитьДанныеПоЗапросамОчистки();
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Функция ОчиститьРазмещенныеPKG()
   	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/TEClear?uuidcom="+ПараметрыСеанса.Сотрудник_ID
	+"&chk="+ТаблицаТУ[0].ИД_ТУ;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Возврат РезОтвет;
КонецФункции

&НаСервере
Процедура ПолучитьДанныеПоЗапросамОчистки() 
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/TEReClear?uuidcom="+ПараметрыСеанса.Сотрудник_ID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	ЕстьЗапрос = РезОтвет.Результат и РезОтвет.Ответ.КоличествоЗапросов>0;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаЗапросОчистки", "Видимость", ЕстьЗапрос);
	Если ЕстьЗапрос Тогда
		Элементы.ДекорацияОчистка.Заголовок = "Запитів на очищення ТО - " + РезОтвет.Ответ.КоличествоЗапросов;
	КонецЕсли;
	
КонецПроцедуры

 &НаСервере
Процедура ДанныеПоЗапросамОчистки() 
	
  	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/TEauditReClear?uuidcom="+ПараметрыСеанса.Сотрудник_ID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса,"ДатаРазмещения,PKGДата");
	ТаблицаТУ.Очистить();
	Если РезОтвет.Результат Тогда 
		ДокументыРазмещения = РезОтвет.Ответ;
		Если ДокументыРазмещения.Количество() = 0 И Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
			Возврат;
		КонецЕсли;
		
		сч = 1;
		Для Каждого СтрокаДокумент Из ДокументыРазмещения Цикл 
			НовСтрокаТУ = ТаблицаТУ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТУ,СтрокаДокумент);
			НовСтрокаТУ.НомерСтроки =сч;
			НовСтрокаТУ.ЗаписьПоСтроке ="PKG - " +НовСтрокаТУ.PKGНомер+" від "+ Формат(НовСтрокаТУ.PKGДата, "ДФ=dd.MM.yyyy");
			сч = сч +1;
		КонецЦикла;
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеТЕ_НаСервере(ШК_ТЕ)
	
	МассивТЕ = СтрРазделить(ШК_ТЕ,";",);	 
	ТЕUUID = МассивТЕ[1]; 
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/TEaudit?uuidcom="+ПараметрыСеанса.Сотрудник_ID
	+"&chk="+ТЕUUID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса,"ДатаРазмещения,PKGДата");
	ТаблицаТУ.Очистить();
	Если РезОтвет.Результат Тогда 
		ДокументыРазмещения = РезОтвет.Ответ;
		сч = 1;
		Для Каждого СтрокаДокумент Из ДокументыРазмещения Цикл 
			НовСтрокаТУ = ТаблицаТУ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТУ,СтрокаДокумент);
			НовСтрокаТУ.ИД_ТУ = ТЕUUID;
			НовСтрокаТУ.НомерСтроки =сч;
			НовСтрокаТУ.ЗаписьПоСтроке ="PKG - " +НовСтрокаТУ.PKGНомер+" від "+ Формат(НовСтрокаТУ.PKGДата, "ДФ=dd.MM.yyyy");
			сч = сч +1;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РезОтвет;
	
КонецФункции


&НаСервере
Функция ПолучитьДанныеPKG_НаСервере(ШК_PKG)
	
	МассивШК = СтрРазделить(ШК_PKG,";",);	 
	PKGUUID = МассивШК[0]; 
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/PKGaudit?uuidcom="+ПараметрыСеанса.Сотрудник_ID
	+"&chk="+PKGUUID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса,"Дата");
	ТаблицаPKG.Очистить(); 
	ТаблицаШК.Очистить();
	тОбъектДоставки = ""; 
	тМаршрут = "";    
	тСостояние = "";   
	тИД_Короб = "";  
	тПроверка="";
	Если РезОтвет.Результат Тогда 
		
		СтруктураPKG = РезОтвет.Ответ;
		Если СтруктураPKG.stat = 0 Тогда
			Сообщить("ВАЖЛИВО!"+Символы.ПС+СтруктураPKG.info);
			Возврат Ложь;
		КонецЕсли; 
		тОбъектДоставки = СтруктураPKG.ОбъектДоставки; 
		тМаршрут = СтруктураPKG.МаршрутPKG;
		тСостояние = СтруктураPKG.СостояниеPKG;
		тИД_Короб = PKGUUID;	 
		Если СтруктураPKG.Проверен = 1 Тогда
			тПроверка = "Перевірка виконана"	
		Иначе
			тПроверка = "Не виконано";
		КонецЕсли;
		
		сч = 1;
		Для Каждого стрТоварыPKG Из  СтруктураPKG.ТоварыPKG Цикл 
			НовСтрокаPKG = ТаблицаPKG.Добавить();
			НовСтрокаPKG.НомерСтроки = сч;
			НовСтрокаPKG.Артикул = стрТоварыPKG.Артикул;
			НовСтрокаPKG.НаименованиеЕдиницы = стрТоварыPKG.ЕдИзм;
			НовСтрокаPKG.Коэффициент  = стрТоварыPKG.Коф;
			НовСтрокаPKG.Количество = стрТоварыPKG.Кол;
			НовСтрокаPKG.Весовой  = стрТоварыPKG.фВес;
			НовСтрокаPKG.МРЦ      = стрТоварыPKG.МРЦ;
			
			Если стрТоварыPKG.Свойство("sht") Тогда
				Если стрТоварыPKG.Свойство("sht2")	И стрТоварыPKG.sht2 <> 0 Тогда  
					НовСтрокаPKG.ПриемДо = ТекущаяДата()+(стрТоварыPKG.sht/100)*стрТоварыPKG.sht2*86400-864000;
				Иначе
					НовСтрокаPKG.ПриемДо = ТекущаяДата()+(стрТоварыPKG.sht/3*2)*86400-864000;
				КонецЕсли
			КонецЕсли;
			
			
			//
			//Если НовСтрокаPKG.МРЦ<>0  Тогда
			//	тНаименованиеТовара = стрТоварыPKG.Tovar  + " МРЦ - " + НовСтрокаPKG.МРЦ;
			//Иначе
			//	тНаименованиеТовара = стрТоварыPKG.Tovar;
			//КонецЕсли;
			НовСтрокаPKG.НаименованиеТовара = стрТоварыPKG.Tovar;
			
			
			ЗаписьПоСтроке = "%сдп% кіл-ть. %Количество%%НаименованиеЕдиницы% Х %Коэффициент% %МРЦ%";
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Количество%",           Формат(НовСтрокаPKG.Количество,?(НовСтрокаPKG.Весовой = 1,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())));
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%НаименованиеЕдиницы%",  Строка(НовСтрокаPKG.НаименованиеЕдиницы));
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Коэффициент%",          Строка(НовСтрокаPKG.Коэффициент));
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%МРЦ%",   ?(НовСтрокаPKG.МРЦ<>0," МРЦ - " + НовСтрокаPKG.МРЦ,""));
			
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%сдп%",      ?(ЗначениеЗаполнено(НовСтрокаPKG.ПриемДо), "ддп "+Формат(НовСтрокаPKG.ПриемДо,"ДФ=dd.MM.yyyy"),""));
			НовСтрокаPKG.ЗаписьПоСтроке = ЗаписьПоСтроке;
			
			сч = сч +1;
		КонецЦикла; 
		
		Для Каждого СтрШтрихКод Из СтруктураPKG.ШтрихКодаPKG Цикл 
			СтрокаШтрихкод = ТаблицаШК.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаШтрихкод,СтрШтрихКод);
		КонецЦикла;
		
		
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура НайтиТоварPKG_НаКлиенте(ШК_Товара)

	МассивШтрихкода = ТаблицаШК.НайтиСтроки(Новый Структура("ШтрихКод",ШК_Товара));
	Если МассивШтрихкода.Количество() = 0 Тогда
		Возврат ;
	КонецЕсли;
	
	СтрокаТЗ_Штрихкод = МассивШтрихкода[0];
	ВыбМРЦ = 0;
	Если СтрокаТЗ_Штрихкод.испХар = 1 Тогда
		ВыбратьМРЦ_Асинх(СтрокаТЗ_Штрихкод);
	Иначе
		ОбработатьСтрокуPKG(СтрокаТЗ_Штрихкод,ВыбМРЦ);	
	КонецЕсли;
	
	
	
КонецПроцедуры 

&НаКлиенте
Асинх Процедура ВыбратьМРЦ_Асинх(СтрокаТЗ_Штрихкод)
	Обещание =  ВвестиЧислоАсинх(0,"МРЦ",10,2);
	ВыбМРЦ = Ждать Обещание;  
	ОбработатьСтрокуPKG(СтрокаТЗ_Штрихкод,ВыбМРЦ);
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьСтрокуPKG(СтрокаТЗ_Штрихкод,ВыбМРЦ)	
	НайденныеСтроки = ТаблицаPKG.НайтиСтроки(Новый Структура("Артикул,МРЦ", СтрокаТЗ_Штрихкод.Артикул,ВыбМРЦ));
    Если НайденныеСтроки.Количество() = 0 Тогда
    	Сообщить("Товару немає в PKG");
		Возврат;
	КонецЕсли;
	СтрокаТЧ = НайденныеСтроки[0];       
	
	ШтШтрихкод = СтрокаТЗ_Штрихкод.Коэффициент;
	ШтОтсканировано = СтрокаТЧ.КоличествоОтсканировано; 
	ШтПКГ = СтрокаТЧ.Количество;
	ШтНовОтсканировано = ШтОтсканировано + ШтШтрихкод;
	Если ШтНовОтсканировано > ШтПКГ	Тогда
		Сообщить("Відскановано більше ніж у PKG");
		Возврат;
	Иначе 
		СтрокаТЧ.КоличествоОтсканировано = ШтНовОтсканировано; 
		
		
		ЗаписьПоСтроке = "%сдп% кіл-ть. %Количество% / %КоличествоОтсканировано% %НаименованиеЕдиницы% Х %Коэффициент% %МРЦ%";
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Количество%",           Формат(СтрокаТЧ.Количество,?(СтрокаТЧ.Весовой = 1,"ЧЦ=15; ЧДЦ=3; ЧН=0.000; ЧРД=.; ЧГ=0","ЧЦ=4; ЧДЦ=0; ЧН=0; ЧГ=")));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%НаименованиеЕдиницы%",  Строка(СтрокаТЧ.НаименованиеЕдиницы));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Коэффициент%",          Строка(СтрокаТЧ.Коэффициент));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%КоличествоОтсканировано%", Формат(СтрокаТЧ.КоличествоОтсканировано,?(СтрокаТЧ.Весовой = 1,"ЧЦ=15; ЧДЦ=3; ЧН=0.000; ЧРД=.; ЧГ=0","ЧЦ=4; ЧДЦ=0; ЧН=0; ЧГ=")));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%МРЦ%",   ?(СтрокаТЧ.МРЦ<>0," МРЦ - " + СтрокаТЧ.МРЦ,""));
		
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%сдп%",      ?(ЗначениеЗаполнено(СтрокаТЧ.ПриемДо), "ддп "+Формат(СтрокаТЧ.ПриемДо,"ДФ=dd.MM.yyyy"),""));
		СтрокаТЧ.ЗаписьПоСтроке = ЗаписьПоСтроке;
		
		
	КонецЕсли;   

	Элементы.ТаблицаPKG.ТекущаяСтрока = СтрокаТЧ.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаPKGВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаPKGПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаPKGПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаPKG(Команда)
	ВсеОк = Истина;	
	Для Каждого СтрокаТабицы Из ТаблицаPKG Цикл 
		Если СтрокаТабицы.Количество<>СтрокаТабицы.КоличествоОтсканировано Тогда
			Сообщить(СтрокаТабицы.НаименованиеТовара+" кол-во PKG - "+СтрокаТабицы.Количество +" отсканировано -"+СтрокаТабицы.КоличествоОтсканировано);
			ВсеОк = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	Если ТаблицаPKG.Количество() = 0 Тогда
		ВсеОк = Ложь;
	КонецЕсли;
	
	
	Если ВсеОк Тогда
		Рез = ПроверкаPKG_Завершение();	
		Если НЕ Рез.Результат Тогда  
			Если НЕ ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
				Сообщить(Рез.ОписаниеОшибки); 
			КонецЕсли; 
		Иначе
			ТаблицаPKG.Очистить(); 
			ТаблицаШК.Очистить();
			тИД_Короб = "";
			тПроверка="";
		КонецЕсли; 

	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Функция ПроверкаPKG_Завершение()
   	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/PKGauditF?uuidcom="+ПараметрыСеанса.Сотрудник_ID
	+"&chk="+тИД_Короб;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Возврат РезОтвет;
КонецФункции
